<?php

declare(strict_types=1);

return [
    'file' => [
        'upload' => 'لا يمكن تحميل الملف!',
        'upload_validation' => 'الملف المحمل غير صالح!',
        'rename' => 'لا يمكن إعادة تسمية الملف!',
        'delete' => 'لا يمكن حذف الملف!',
        'unzip' => 'لا يمكن فك ضغط الملف، لأنه غير صالح أو أن الوجهة موجودة بالفعل!',
    ],

    'folder' => [
        'create' => 'لا يمكن إنشاء المجلد!',
        'rename' => 'لا يمكن إعادة تسمية المجلد!',
        'delete' => 'لا يمكن حذف المجلد!',
    ],

    'authorization' => [
        'unauthorized' => 'هذا الإجراء [:action] غير مصرح به.',
    ],
];
